#### AddBarGeometry Method (CurveLoop)

---

|  |
| --- |
| RebarTrimExtendData Class   See Also |

Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public RebarFreeFormValidationResult AddBarGeometry( 	CurveLoop curves ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddBarGeometry ( _ 	curves As CurveLoop _ ) As RebarFreeFormValidationResult ``` |

| Visual C++ |
| --- |
| ``` public: RebarFreeFormValidationResult AddBarGeometry( 	CurveLoop^ curves ) ``` |

#### Parameters

curves
:   Type:  Autodesk.Revit.DB CurveLoop
     Curves describing one bar in the set.

#### Return Value

Returns Success if everything is ok, otherwise the failure reason.

# Remarks

This function can fail due to following reasons:

* CurveLoop is empty.
* CurveLoop contains an unbounded curve.
* A rebar constructed from curves can't be bent according to the bending radius.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Incorrect number of bar geometry. |

# See Also

RebarTrimExtendData Class

AddBarGeometry Overload

Autodesk.Revit.DB.Structure Namespace